class TranslationConstants {
  static const Map<String, Map<String, dynamic>> map = {
    'en': {
      'more': 'More',
      'mushaf': 'Mushaf',
      'index': 'Index',
      'scan': 'Scan',
      'juz': 'Juz',
      'surah': 'Surah',
      'page': 'Page',
      'defaultQari': 'Default Reciter',
      'settings': 'Settings',
      'language': 'Language',
      'ayah': 'Ayah',
      'para': 'Juz',
    },
    'ur': {
      'more': 'مزید',
      'mushaf': 'مصحف',
      'index': 'فہرست',
      'scan': 'اسکین',
      'juz': 'پارہ',
      'surah': 'سورہ',
      'page': 'صفحہ',
      'defaultQari': 'منتخب قاری',
      'settings': 'ترتیبات',
      'language': 'زبان',
      'ayah': 'آیت',
      'para': 'پارہ',
      'surah_names': {
        '1': 'الفاتحہ', '2': 'البقرہ', '3': 'آل عمران', '4': 'النساء', '5': 'المائدہ',
        '6': 'الانعام', '7': 'الاعراف', '8': 'الانفال', '9': 'التوبہ', '10': 'یونس',
        '11': 'ہود', '12': 'یوسف', '13': 'الرعد', '14': 'ابراہیم', '15': 'الحجر',
        '16': 'النحل', '17': 'الاسراء', '18': 'الکہف', '19': 'مریم', '20': 'طہ',
        '21': 'الانبیاء', '22': 'الحج', '23': 'المؤمنون', '24': 'النور', '25': 'الفرقان',
        '26': 'الشعراء', '27': 'النمل', '28': 'القصص', '29': 'العنکبوت', '30': 'الروم',
        '31': 'لقمان', '32': 'السجدہ', '33': 'الاحزاب', '34': 'سبا', '35': 'فاطر',
        '36': 'یس', '37': 'الصافات', '38': 'ص', '39': 'الزمر', '40': 'غافر',
        '41': 'فصلت', '42': 'الشوری', '43': 'الزخرف', '44': 'الدخان', '45': 'الجاثیہ',
        '46': 'الاحقاف', '47': 'محمد', '48': 'الفتح', '49': 'الحجرات', '50': 'ق',
        '51': 'الذاریات', '52': 'الطور', '53': 'النجم', '54': 'القمر', '55': 'الرحمن',
        '56': 'الواقعہ', '57': 'الحدید', '58': 'المجادلہ', '59': 'الحشر', '60': 'الممتحنہ',
        '61': 'الصف', '62': 'الجمعة', '63': 'المنافقون', '64': 'التغابن', '65': 'الطلاق',
        '66': 'التحریم', '67': 'الملک', '68': 'القلم', '69': 'الحاقہ', '70': 'المعارج',
        '71': 'نوح', '72': 'الجن', '73': 'المزمل', '74': 'المدثر', '75': 'القیامہ',
        '76': 'الانسان', '77': 'المرسلات', '78': 'النبا', '79': 'النازعات', '80': 'عبس',
        '81': 'التکویر', '82': 'الانفطار', '83': 'المطففین', '84': 'الانشقاق', '85': 'البروج',
        '86': 'الطارق', '87': 'الاعلی', '88': 'الغاشیہ', '89': 'الفجر', '90': 'البلد',
        '91': 'الشمس', '92': 'اللیل', '93': 'الضحی', '94': 'الشرح', '95': 'التین',
        '96': 'العلق', '97': 'القدر', '98': 'البینہ', '99': 'الزلزلہ', '100': 'العادیات',
        '101': 'القارعہ', '102': 'التکاثر', '103': 'العصر', '104': 'الہمزہ', '105': 'الفیل',
        '106': 'قریش', '107': 'الماعون', '108': 'الکوثر', '109': 'الکافرون', '110': 'النصر',
        '111': 'المسد', '112': 'الاخلاص', '113': 'الفلق', '114': 'الناس',
      }
    }
  };

  static String getString(String langCode, String key) {
    if (key.startsWith('surah_')) {
      final surahIndex = key.replaceAll('surah_', '');
      final suratMap = map[langCode]?['surah_names'];
      if (suratMap is Map) {
        return suratMap[surahIndex] ?? key;
      }
      return key;
    }
    final value = map[langCode]?[key] ?? map['en']?[key] ?? key;
    return value is String ? value : key;
  }

  static String toUrduDigits(int number) {
    const englishToUrduDigits = {
      '0': '۰', '1': '۱', '2': '۲', '3': '۳', '4': '۴',
      '5': '۵', '6': '۶', '7': '۷', '8': '۸', '9': '۹',
    };
    final String numberStr = number.toString();
    StringBuffer sb = StringBuffer();
    for (int i = 0; i < numberStr.length; i++) {
        sb.write(englishToUrduDigits[numberStr[i]] ?? numberStr[i]);
    }
    return sb.toString();
  }
}
